$(document).ready(function () {
	$('input').iCheck({
		checkboxClass: 'icheckbox_square-green',
		radioClass:    'iradio_square-green',
		increaseArea:  '20%' // optional
	});

	$(".showinfo").click(function(){
		$("#org_people_dialog").slideToggle("fast");
		return false;
	});

	//表格的配置
	var i18n_chinese = {
		"sProcessing":     "处理中...",
		"sLengthMenu":     "显示 _MENU_ 项结果",
		"sZeroRecords":    "没有匹配结果",
		"sInfo":           "显示第 _START_ 至 _END_ 项结果，共 _TOTAL_ 项",
		"sInfoEmpty":      "显示第 0 至 0 项结果，共 0 项",
		"sInfoFiltered":   "(由 _MAX_ 项结果过滤)",
		"sInfoPostFix":    "",
		"sSearch":         "表内搜索:",
		"sUrl":            "",
		"sEmptyTable":     "表中数据为空",
		"sLoadingRecords": "载入中...",
		"sInfoThousands":  ",",
		"oPaginate":       {
			"sFirst":    "首页",
			"sPrevious": "上页",
			"sNext":     "下页",
			"sLast":     "末页"
		},
		"oAria":           {
			"sSortAscending":  ": 以升序排列此列",
			"sSortDescending": ": 以降序排列此列"
		}
	};


	var dataSet =[
		{"姓名":"左占平","性别":"男","出生年月":"1976","民族":"汉","入学年级":"1994","学院":"机电","专业":"机电控制及自动化","学历":"本科","手机":"13511001792","办公电话":"空","职务":"销售经理","工作单位":"德国依科视朗国际射线有限公司北京代表处","省":"北京","市":"北京","微信号":"空","QQ号":"空","邮箱":"空","编号":"1001","管理学院":"机电工程学院","毕业年级":"1998"},
		{"姓名":"李晓伟","性别":"男","出生年月":"1977","民族":"汉","入学年级":"1995","学院":"计通","专业":"计算机科学与技术","学历":"本科","手机":"13210801270","办公电话":"010-2710530","职务":"云事业部部门经理","工作单位":"百度公司","省":"北京","市":"北京","微信号":"空","QQ号":"232312313","邮箱":"空","编号":"1002","管理学院":"计算机与通信学院","毕业年级":"1999"},
		{"姓名":"梁根深","性别":"男","出生年月":"1990","民族":"汉","入学年级":"2009","学院":"材料","专业":"无机非金属材料与工程","学历":"本科","手机":"13511001794","办公电话":"空","职务":"干事","工作单位":"白银有色金属公司","省":"甘肃","市":"白银","微信号":"18r6345102","QQ号":"空","邮箱":"lianggenze@163.com","编号":"1003","管理学院":"材料学院","毕业年级":"2013"},
		{"姓名":"李晓伟","性别":"男","出生年月":"1979","民族":"汉","入学年级":"1997","学院":"机电","专业":"机电控制及自动化","学历":"本科","手机":"13511001795","办公电话":"空","职务":"销售经理","工作单位":"德国依科视朗国际射线有限公司北京代表处","省":"北京","市":"北京","微信号":"空","QQ号":"空","邮箱":"空","编号":"1004","管理学院":"机电工程学院","毕业年级":"2001"},
		{"姓名":"刘青","性别":"女","出生年月":"1980","民族":"汉","入学年级":"1998","学院":"设计","专业":"建筑学","学历":"硕士","手机":"18114324120","办公电话":"空","职务":"讲师","工作单位":"西安建筑科技大学","省":"陕西","市":"西安","微信号":"空","QQ号":"空","邮箱":"liuqing163@163.com","编号":"1005","管理学院":"设计艺术学院","毕业年级":"2002"},
		{"姓名":"洪志国","性别":"男","出生年月":"1977","民族":"汉","入学年级":"1996","学院":"土木","专业":"桥梁工程","学历":"本科","手机":"15180101270","办公电话":"0931-2975953","职务":"领队","工作单位":"甘肃省地质勘查队","省":"甘肃","市":"兰州","微信号":"空","QQ号":"29582719","邮箱":"空","编号":"1006","管理学院":"土木工程学院","毕业年级":"2000"},
		{"姓名":"袁本初","性别":"男","出生年月":"1980","民族":"汉","入学年级":"1998","学院":"石化","专业":"应用化学","学历":"本科","手机":"13511001798","办公电话":"空","职务":"销售经理","工作单位":"新疆克拉玛依红友集团","省":"新疆","市":"克拉玛依","微信号":"空","QQ号":"空","邮箱":"yuanbenchu@hy.cn","编号":"1007","管理学院":"石油化工学院","毕业年级":"2002"},
		{"姓名":"林明美","性别":"女","出生年月":"1993","民族":"汉","入学年级":"2011","学院":"外国语","专业":"日语","学历":"本科","手机":"18921010110","办公电话":"空","职务":"歌手","工作单位":"上海SH48事务所","省":"上海","市":"上海","微信号":"空","QQ号":"48929131","邮箱":"空","编号":"1008","管理学院":"外国语学院","毕业年级":"2015"},
		{"姓名":"刘立群","性别":"男","出生年月":"1984","民族":"汉","入学年级":"2002","学院":"理学院","专业":"应用数学","学历":"本科","手机":"13511001800","办公电话":"空","职务":"销售经理","工作单位":"天水花牛苹果公司","省":"甘肃","市":"天水","微信号":"空","QQ号":"空","邮箱":"空","编号":"1009","管理学院":"理学院","毕业年级":"2006"},
		{"姓名":"侯君集","性别":"男","出生年月":"1985","民族":"汉","入学年级":"2003","学院":"能动","专业":"流体机械及工程系","学历":"硕士","手机":"13511001801","办公电话":"空","职务":"研究员","工作单位":"陕西自动化装备研究所","省":"陕西","市":"西安","微信号":"空","QQ号":"空","邮箱":"houjunji@126.com","编号":"1010","管理学院":"能源与动力工程学院","毕业年级":"2007"},
		{"姓名":"高士廉","性别":"男","出生年月":"1986","民族":"汉","入学年级":"2004","学院":"机电","专业":"机械设计","学历":"本科","手机":"13511001802","办公电话":"空","职务":"研究员","工作单位":"江南造船集团","省":"江苏","市":"南京","微信号":"空","QQ号":"空","邮箱":"空","编号":"1011","管理学院":"机电工程学院","毕业年级":"2008"},
		{"姓名":"柴绍","性别":"男","出生年月":"1987","民族":"汉","入学年级":"2005","学院":"计通","专业":"计算机科学与技术","学历":"本科","手机":"13511001803","办公电话":"空","职务":"项目经理","工作单位":"中软集团","省":"北京","市":"北京","微信号":"85622011","QQ号":"85622011","邮箱":"空","编号":"1012","管理学院":"计算机与通信学院","毕业年级":"2009"},
		{"姓名":"唐俭","性别":"男","出生年月":"1988","民族":"汉","入学年级":"2006","学院":"土木","专业":"工程管理系","学历":"硕士","手机":"15101225849","办公电话":"空","职务":"项目经理","工作单位":"中铁十二局","省":"河南","市":"郑州","微信号":"15101225849","QQ号":"空","邮箱":"15101225849@qq.com","编号":"1013","管理学院":"土木工程学院","毕业年级":"2010"},
		{"姓名":"马玲玉","性别":"女","出生年月":"1989","民族":"回","入学年级":"2007","学院":"经管","专业":"市场营销","学历":"本科","手机":"18190232321","办公电话":"空","职务":"店长","工作单位":"法国迪卡侬中国分公司四川分部","省":"四川","市":"成都","微信号":"空","QQ号":"23801281","邮箱":"空","编号":"1014","管理学院":"经管学院","毕业年级":"2011"},
		{"姓名":"屈突通","性别":"男","出生年月":"1977","民族":"羌","入学年级":"1996","学院":"经管","专业":"市场营销","学历":"本科","手机":"13190232321","办公电话":"空","职务":"部门经理","工作单位":"武昌国际大酒店食品部","省":"湖北","市":"武汉","微信号":"18121213131","QQ号":"空","邮箱":"空","编号":"1015","管理学院":"经管学院","毕业年级":"2000"},

	]

	$('#orgd_table').DataTable({

		"ajax":" ",
		columns:      [

			{title: "组织名称", data: "org_name"},
			{title: "成立日期", data: "org_found_time"},
			{title: "组织人数 ",data:"org_member_num"},
			{title: "出生年月", data: "user_birthday"},
			{title: " 联系方式", data: "org_contact_info"},
		    {title: "所在地", data: "user_city"},

		],
		"language":   i18n_chinese,
		"order":      [[0, 'asc']],
		"autoWidth":  true,
		searching:    true,
		paging:       true,
		aaSorting:    []
	});

	/*$('#org_table').dataTable({
		"language": i18n_chinese,
		searching:    false,
		aoColumnDefs: [
			{
				bSortable: false,
				aTargets:  [0]
			}
		],
		aaSorting:    []
	});*/

	$("#search-btn").click(function(){
		var search_content=$("#search_content").val();
		if(search_content==null||search_content==""){
			alert("请输入校友组织名称再进行查询！");
		}else{
			var user_pk=localStorage.getItem("user_pk");
			var token=localStorage.getItem("token");
			$.ajax({
				url:"",
				type:post,
				data:{"user_pk":user_pk,
					"token":token,
					"search_schoomatesorganisation":search_content
				},
				success:function(datas){
					$('#org_table').dataTable({
						column:
							[
								{title: "组织名称", data: "org_name"},
								{title: "成立日期", data: "org_found_time"},
								{title: "组织人数 ",data:"org_member_num"},
								{title: "出生年月", data: "user_birthday"},
								{title: " 联系方式", data: "org_contact_info"},
								{title: "所在地", data: "user_city"},
							],
					});
				},
				error:function(data){

				}
			});
		}
	});

});